zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_GLOBAL.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_SW_GLOBAL.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_SW_GLOBAL
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_SW_GLOBAL_H_)  /* Check if memory map has not been already included */
#define S32K566_SW_GLOBAL_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- SW_GLOBAL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SW_GLOBAL_Peripheral_Access_Layer SW_GLOBAL Peripheral Access Layer
 * @{
 */

/** SW_GLOBAL - Size of Registers Arrays */
#define SW_GLOBAL_PCE_SL_COUNT                    1u
#define SW_GLOBAL_HTA_LOOP_COUNT                  1u
#define SW_GLOBAL_ARRAY_NUM_RC_COUNT              1u
#define SW_GLOBAL_G_BOOT_COUNT                    2u

/** SW_GLOBAL - Register Layout Typedef */
typedef struct SW_GLOBAL_Struct {
  __I  uint32_t SMCAPR;                            /**< Shared memory capability register, offset: 0x0 */
  __I  uint32_t SMDTR;                             /**< Shared memory depletion threshold register, offset: 0x4 */
  __I  uint32_t SMACR;                             /**< Shared memory available count register, offset: 0x8 */
  uint8_t RESERVED_0[4];
  __I  uint32_t SMCLWMR;                           /**< Shared memory count low watermark register, offset: 0x10 */
  __I  uint32_t SMBUCR;                            /**< Shared memory buffer unassigned count register, offset: 0x14 */
  __I  uint32_t SMBUCHWMR;                         /**< Shared memory buffer unassigned count high watermark register, offset: 0x18 */
  __I  uint32_t SMLCR;                             /**< Shared memory loss count register, offset: 0x1C */
  __I  uint32_t HBTCAPR;                           /**< Hash bucket table capability register, offset: 0x20 */
  __I  uint32_t HBTOR0;                            /**< Hash bucket table operational register 0, offset: 0x24 */
  uint8_t RESERVED_1[4];
  __I  uint32_t HBTOR2;                            /**< Hash bucket table operational register 2, offset: 0x2C */
  uint8_t RESERVED_2[16];
  __I  uint32_t SMERBCAPR;                         /**< Shared memory ENETC receive buffer capability register, offset: 0x40 */
  __I  uint32_t SMERBOR0;                          /**< Shared memory ENETC receive buffer operational register 0, offset: 0x44 */
  __I  uint32_t SMERBOR1;                          /**< Shared memory ENETC receive buffer operational 1, offset: 0x48 */
  uint8_t RESERVED_3[180];
  struct SW_GLOBAL_PCE_SL {                        /* offset: 0x100, array step: 0x8 */
    __I  uint32_t PCEOR;                             /**< PCE 0 operational register, array offset: 0x100, array step: 0x8 */
    __I  uint32_t RFEOR;                             /**< Replication Forwarding Engine 0 operational register, array offset: 0x104, array step: 0x8 */
  } PCE_SL[SW_GLOBAL_PCE_SL_COUNT];
  uint8_t RESERVED_4[92];
  __I  uint32_t NETCCLKR;                          /**< NETC clock register, offset: 0x164 */
  uint8_t RESERVED_5[152];
  struct SW_GLOBAL_HTA_LOOP {                      /* offset: 0x200, array step: 0x28 */
    __I  uint32_t HTACAPR;                           /**< HTA 0 capability register, array offset: 0x200, array step: 0x28 */
    __I  uint32_t HTARFCOR;                          /**< HTA 0 receive frame count operational register, array offset: 0x204, array step: 0x28 */
    __I  uint32_t HTAHPBCOR;                         /**< HTA 0 high priority byte count operational register, array offset: 0x208, array step: 0x28 */
    __I  uint32_t HTALPBCOR;                         /**< HTA 0 low priority byte count operational register, array offset: 0x20C, array step: 0x28 */
    uint8_t RESERVED_0[20];
    __I  uint32_t HTATFCOR;                          /**< HTA 0 transmit frame count operational register, array offset: 0x224, array step: 0x28 */
  } HTA_LOOP[SW_GLOBAL_HTA_LOOP_COUNT];
  uint8_t RESERVED_6[216];
  struct SW_GLOBAL_ARRAY_NUM_RC {                  /* offset: 0x300, array step: 0x10 */
    __IO uint32_t RCSBRLAR;                          /**< Root complex 0 system bus read latency average register, array offset: 0x300, array step: 0x10 */
    __I  uint32_t RCSBRLHWMR;                        /**< Root complex 0 system bus read latency high watermark register, array offset: 0x304, array step: 0x10 */
    __IO uint32_t RCSBWLAR;                          /**< Root complex 0 system bus write latency average register, array offset: 0x308, array step: 0x10 */
    __I  uint32_t RCSBWLHWMR;                        /**< Root complex 0 system bus write latency high watermark register, array offset: 0x30C, array step: 0x10 */
  } ARRAY_NUM_RC[SW_GLOBAL_ARRAY_NUM_RC_COUNT];
  uint8_t RESERVED_7[2280];
  __I  uint32_t IPBRR0;                            /**< IP block revision register 0, offset: 0xBF8 */
  __I  uint32_t IPBRR1;                            /**< IP block revision register 1, offset: 0xBFC */
  uint8_t RESERVED_8[256];
  __I  uint32_t FBLPR[SW_GLOBAL_G_BOOT_COUNT];     /**< Function boot loader parameter register 0..Function boot loader parameter register 1, array offset: 0xD00, array step: 0x4 */
} SW_GLOBAL_Type, *SW_GLOBAL_MemMapPtr;

/** Number of instances of the SW_GLOBAL module. */
#define SW_GLOBAL_INSTANCE_COUNT                 (1u)

/* SW_GLOBAL - Peripheral instance base addresses */
/** Peripheral NETC__SW0_GLOBAL base address */
#define IP_NETC__SW0_GLOBAL_BASE                 (0x6D070000u)
/** Peripheral NETC__SW0_GLOBAL base pointer */
#define IP_NETC__SW0_GLOBAL                      ((SW_GLOBAL_Type *)IP_NETC__SW0_GLOBAL_BASE)
/** Array initializer of SW_GLOBAL peripheral base addresses */
#define IP_SW_GLOBAL_BASE_ADDRS                  { IP_NETC__SW0_GLOBAL_BASE }
/** Array initializer of SW_GLOBAL peripheral base pointers */
#define IP_SW_GLOBAL_BASE_PTRS                   { IP_NETC__SW0_GLOBAL }

/* ----------------------------------------------------------------------------
   -- SW_GLOBAL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SW_GLOBAL_Register_Masks SW_GLOBAL Register Masks
 * @{
 */

/*! @name SMCAPR - Shared memory capability register */
/*! @{ */

#define SW_GLOBAL_SMCAPR_NUM_WORDS_MASK          (0xFFFFFFU)
#define SW_GLOBAL_SMCAPR_NUM_WORDS_SHIFT         (0U)
#define SW_GLOBAL_SMCAPR_NUM_WORDS_WIDTH         (24U)
#define SW_GLOBAL_SMCAPR_NUM_WORDS(x)            (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMCAPR_NUM_WORDS_SHIFT)) & SW_GLOBAL_SMCAPR_NUM_WORDS_MASK)
/*! @} */

/*! @name SMDTR - Shared memory depletion threshold register */
/*! @{ */

#define SW_GLOBAL_SMDTR_THRESH_MASK              (0xFFFFFFU)
#define SW_GLOBAL_SMDTR_THRESH_SHIFT             (0U)
#define SW_GLOBAL_SMDTR_THRESH_WIDTH             (24U)
#define SW_GLOBAL_SMDTR_THRESH(x)                (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMDTR_THRESH_SHIFT)) & SW_GLOBAL_SMDTR_THRESH_MASK)
/*! @} */

/*! @name SMACR - Shared memory available count register */
/*! @{ */

#define SW_GLOBAL_SMACR_COUNT_MASK               (0xFFFFFFU)
#define SW_GLOBAL_SMACR_COUNT_SHIFT              (0U)
#define SW_GLOBAL_SMACR_COUNT_WIDTH              (24U)
#define SW_GLOBAL_SMACR_COUNT(x)                 (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMACR_COUNT_SHIFT)) & SW_GLOBAL_SMACR_COUNT_MASK)
/*! @} */

/*! @name SMCLWMR - Shared memory count low watermark register */
/*! @{ */

#define SW_GLOBAL_SMCLWMR_WATERMARK_MASK         (0xFFFFFFU)
#define SW_GLOBAL_SMCLWMR_WATERMARK_SHIFT        (0U)
#define SW_GLOBAL_SMCLWMR_WATERMARK_WIDTH        (24U)
#define SW_GLOBAL_SMCLWMR_WATERMARK(x)           (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMCLWMR_WATERMARK_SHIFT)) & SW_GLOBAL_SMCLWMR_WATERMARK_MASK)
/*! @} */

/*! @name SMBUCR - Shared memory buffer unassigned count register */
/*! @{ */

#define SW_GLOBAL_SMBUCR_COUNT_MASK              (0xFFFFFFU)
#define SW_GLOBAL_SMBUCR_COUNT_SHIFT             (0U)
#define SW_GLOBAL_SMBUCR_COUNT_WIDTH             (24U)
#define SW_GLOBAL_SMBUCR_COUNT(x)                (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMBUCR_COUNT_SHIFT)) & SW_GLOBAL_SMBUCR_COUNT_MASK)
/*! @} */

/*! @name SMBUCHWMR - Shared memory buffer unassigned count high watermark register */
/*! @{ */

#define SW_GLOBAL_SMBUCHWMR_WATERMARK_MASK       (0xFFFFFFU)
#define SW_GLOBAL_SMBUCHWMR_WATERMARK_SHIFT      (0U)
#define SW_GLOBAL_SMBUCHWMR_WATERMARK_WIDTH      (24U)
#define SW_GLOBAL_SMBUCHWMR_WATERMARK(x)         (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMBUCHWMR_WATERMARK_SHIFT)) & SW_GLOBAL_SMBUCHWMR_WATERMARK_MASK)
/*! @} */

/*! @name SMLCR - Shared memory loss count register */
/*! @{ */

#define SW_GLOBAL_SMLCR_COUNT_MASK               (0xFFFFFFU)
#define SW_GLOBAL_SMLCR_COUNT_SHIFT              (0U)
#define SW_GLOBAL_SMLCR_COUNT_WIDTH              (24U)
#define SW_GLOBAL_SMLCR_COUNT(x)                 (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMLCR_COUNT_SHIFT)) & SW_GLOBAL_SMLCR_COUNT_MASK)

#define SW_GLOBAL_SMLCR_IFLC_MASK                (0x40000000U)
#define SW_GLOBAL_SMLCR_IFLC_SHIFT               (30U)
#define SW_GLOBAL_SMLCR_IFLC_WIDTH               (1U)
#define SW_GLOBAL_SMLCR_IFLC(x)                  (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMLCR_IFLC_SHIFT)) & SW_GLOBAL_SMLCR_IFLC_MASK)

#define SW_GLOBAL_SMLCR_IFDC_MASK                (0x80000000U)
#define SW_GLOBAL_SMLCR_IFDC_SHIFT               (31U)
#define SW_GLOBAL_SMLCR_IFDC_WIDTH               (1U)
#define SW_GLOBAL_SMLCR_IFDC(x)                  (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMLCR_IFDC_SHIFT)) & SW_GLOBAL_SMLCR_IFDC_MASK)
/*! @} */

