zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_GLOBAL.h
/*! @name HBTCAPR - Hash bucket table capability register */
/*! @{ */

#define SW_GLOBAL_HBTCAPR_NUM_ENTRIES_MASK       (0xFFFFU)
#define SW_GLOBAL_HBTCAPR_NUM_ENTRIES_SHIFT      (0U)
#define SW_GLOBAL_HBTCAPR_NUM_ENTRIES_WIDTH      (16U)
#define SW_GLOBAL_HBTCAPR_NUM_ENTRIES(x)         (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HBTCAPR_NUM_ENTRIES_SHIFT)) & SW_GLOBAL_HBTCAPR_NUM_ENTRIES_MASK)

#define SW_GLOBAL_HBTCAPR_MAX_COL_MASK           (0x7000000U)
#define SW_GLOBAL_HBTCAPR_MAX_COL_SHIFT          (24U)
#define SW_GLOBAL_HBTCAPR_MAX_COL_WIDTH          (3U)
#define SW_GLOBAL_HBTCAPR_MAX_COL(x)             (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HBTCAPR_MAX_COL_SHIFT)) & SW_GLOBAL_HBTCAPR_MAX_COL_MASK)

#define SW_GLOBAL_HBTCAPR_MAX_VISITS_MASK        (0xF0000000U)
#define SW_GLOBAL_HBTCAPR_MAX_VISITS_SHIFT       (28U)
#define SW_GLOBAL_HBTCAPR_MAX_VISITS_WIDTH       (4U)
#define SW_GLOBAL_HBTCAPR_MAX_VISITS(x)          (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HBTCAPR_MAX_VISITS_SHIFT)) & SW_GLOBAL_HBTCAPR_MAX_VISITS_MASK)
/*! @} */

/*! @name HBTOR0 - Hash bucket table operational register 0 */
/*! @{ */

#define SW_GLOBAL_HBTOR0_NUM_ENTRIES_MASK        (0xFFFFU)
#define SW_GLOBAL_HBTOR0_NUM_ENTRIES_SHIFT       (0U)
#define SW_GLOBAL_HBTOR0_NUM_ENTRIES_WIDTH       (16U)
#define SW_GLOBAL_HBTOR0_NUM_ENTRIES(x)          (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HBTOR0_NUM_ENTRIES_SHIFT)) & SW_GLOBAL_HBTOR0_NUM_ENTRIES_MASK)

#define SW_GLOBAL_HBTOR0_HWM_ENTRIES_MASK        (0xFFFF0000U)
#define SW_GLOBAL_HBTOR0_HWM_ENTRIES_SHIFT       (16U)
#define SW_GLOBAL_HBTOR0_HWM_ENTRIES_WIDTH       (16U)
#define SW_GLOBAL_HBTOR0_HWM_ENTRIES(x)          (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HBTOR0_HWM_ENTRIES_SHIFT)) & SW_GLOBAL_HBTOR0_HWM_ENTRIES_MASK)
/*! @} */

/*! @name HBTOR2 - Hash bucket table operational register 2 */
/*! @{ */

#define SW_GLOBAL_HBTOR2_RUN_AVG_FRACT_MASK      (0xFFU)
#define SW_GLOBAL_HBTOR2_RUN_AVG_FRACT_SHIFT     (0U)
#define SW_GLOBAL_HBTOR2_RUN_AVG_FRACT_WIDTH     (8U)
#define SW_GLOBAL_HBTOR2_RUN_AVG_FRACT(x)        (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HBTOR2_RUN_AVG_FRACT_SHIFT)) & SW_GLOBAL_HBTOR2_RUN_AVG_FRACT_MASK)

#define SW_GLOBAL_HBTOR2_RUN_AVG_INT_MASK        (0xFF00U)
#define SW_GLOBAL_HBTOR2_RUN_AVG_INT_SHIFT       (8U)
#define SW_GLOBAL_HBTOR2_RUN_AVG_INT_WIDTH       (8U)
#define SW_GLOBAL_HBTOR2_RUN_AVG_INT(x)          (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HBTOR2_RUN_AVG_INT_SHIFT)) & SW_GLOBAL_HBTOR2_RUN_AVG_INT_MASK)

#define SW_GLOBAL_HBTOR2_HWM_COL_MASK            (0xF0000U)
#define SW_GLOBAL_HBTOR2_HWM_COL_SHIFT           (16U)
#define SW_GLOBAL_HBTOR2_HWM_COL_WIDTH           (4U)
#define SW_GLOBAL_HBTOR2_HWM_COL(x)              (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HBTOR2_HWM_COL_SHIFT)) & SW_GLOBAL_HBTOR2_HWM_COL_MASK)
/*! @} */

/*! @name SMERBCAPR - Shared memory ENETC receive buffer capability register */
/*! @{ */

#define SW_GLOBAL_SMERBCAPR_THRESH_MASK          (0xFFFFFFU)
#define SW_GLOBAL_SMERBCAPR_THRESH_SHIFT         (0U)
#define SW_GLOBAL_SMERBCAPR_THRESH_WIDTH         (24U)
#define SW_GLOBAL_SMERBCAPR_THRESH(x)            (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMERBCAPR_THRESH_SHIFT)) & SW_GLOBAL_SMERBCAPR_THRESH_MASK)

#define SW_GLOBAL_SMERBCAPR_WORD_SIZE_MASK       (0x30000000U)
#define SW_GLOBAL_SMERBCAPR_WORD_SIZE_SHIFT      (28U)
#define SW_GLOBAL_SMERBCAPR_WORD_SIZE_WIDTH      (2U)
#define SW_GLOBAL_SMERBCAPR_WORD_SIZE(x)         (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMERBCAPR_WORD_SIZE_SHIFT)) & SW_GLOBAL_SMERBCAPR_WORD_SIZE_MASK)

#define SW_GLOBAL_SMERBCAPR_MLOC_MASK            (0xC0000000U)
#define SW_GLOBAL_SMERBCAPR_MLOC_SHIFT           (30U)
#define SW_GLOBAL_SMERBCAPR_MLOC_WIDTH           (2U)
#define SW_GLOBAL_SMERBCAPR_MLOC(x)              (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMERBCAPR_MLOC_SHIFT)) & SW_GLOBAL_SMERBCAPR_MLOC_MASK)
/*! @} */

/*! @name SMERBOR0 - Shared memory ENETC receive buffer operational register 0 */
/*! @{ */

#define SW_GLOBAL_SMERBOR0_AMOUNT_MASK           (0xFFFFFFU)
#define SW_GLOBAL_SMERBOR0_AMOUNT_SHIFT          (0U)
#define SW_GLOBAL_SMERBOR0_AMOUNT_WIDTH          (24U)
#define SW_GLOBAL_SMERBOR0_AMOUNT(x)             (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMERBOR0_AMOUNT_SHIFT)) & SW_GLOBAL_SMERBOR0_AMOUNT_MASK)
/*! @} */

/*! @name SMERBOR1 - Shared memory ENETC receive buffer operational 1 */
/*! @{ */

#define SW_GLOBAL_SMERBOR1_WATERMARK_MASK        (0xFFFFFFU)
#define SW_GLOBAL_SMERBOR1_WATERMARK_SHIFT       (0U)
#define SW_GLOBAL_SMERBOR1_WATERMARK_WIDTH       (24U)
#define SW_GLOBAL_SMERBOR1_WATERMARK(x)          (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_SMERBOR1_WATERMARK_SHIFT)) & SW_GLOBAL_SMERBOR1_WATERMARK_MASK)
/*! @} */

/*! @name PCEOR - PCE 0 operational register */
/*! @{ */

#define SW_GLOBAL_PCEOR_NUM_FRAMES_MASK          (0x7FU)
#define SW_GLOBAL_PCEOR_NUM_FRAMES_SHIFT         (0U)
#define SW_GLOBAL_PCEOR_NUM_FRAMES_WIDTH         (7U)
#define SW_GLOBAL_PCEOR_NUM_FRAMES(x)            (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_PCEOR_NUM_FRAMES_SHIFT)) & SW_GLOBAL_PCEOR_NUM_FRAMES_MASK)

#define SW_GLOBAL_PCEOR_HWM_FRAMES_MASK          (0x7F00U)
#define SW_GLOBAL_PCEOR_HWM_FRAMES_SHIFT         (8U)
#define SW_GLOBAL_PCEOR_HWM_FRAMES_WIDTH         (7U)
#define SW_GLOBAL_PCEOR_HWM_FRAMES(x)            (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_PCEOR_HWM_FRAMES_SHIFT)) & SW_GLOBAL_PCEOR_HWM_FRAMES_MASK)

#define SW_GLOBAL_PCEOR_MAX_FRAMES_MASK          (0x7F0000U)
#define SW_GLOBAL_PCEOR_MAX_FRAMES_SHIFT         (16U)
#define SW_GLOBAL_PCEOR_MAX_FRAMES_WIDTH         (7U)
#define SW_GLOBAL_PCEOR_MAX_FRAMES(x)            (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_PCEOR_MAX_FRAMES_SHIFT)) & SW_GLOBAL_PCEOR_MAX_FRAMES_MASK)
/*! @} */

/*! @name RFEOR - Replication Forwarding Engine 0 operational register */
/*! @{ */

#define SW_GLOBAL_RFEOR_NUM_FRAMES_MASK          (0x3FU)
#define SW_GLOBAL_RFEOR_NUM_FRAMES_SHIFT         (0U)
#define SW_GLOBAL_RFEOR_NUM_FRAMES_WIDTH         (6U)
#define SW_GLOBAL_RFEOR_NUM_FRAMES(x)            (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_RFEOR_NUM_FRAMES_SHIFT)) & SW_GLOBAL_RFEOR_NUM_FRAMES_MASK)

