zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_GLOBAL.h
#define SW_GLOBAL_RFEOR_HWM_FRAMES_MASK          (0x3F00U)
#define SW_GLOBAL_RFEOR_HWM_FRAMES_SHIFT         (8U)
#define SW_GLOBAL_RFEOR_HWM_FRAMES_WIDTH         (6U)
#define SW_GLOBAL_RFEOR_HWM_FRAMES(x)            (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_RFEOR_HWM_FRAMES_SHIFT)) & SW_GLOBAL_RFEOR_HWM_FRAMES_MASK)

#define SW_GLOBAL_RFEOR_MAX_FRAMES_MASK          (0x3F0000U)
#define SW_GLOBAL_RFEOR_MAX_FRAMES_SHIFT         (16U)
#define SW_GLOBAL_RFEOR_MAX_FRAMES_WIDTH         (6U)
#define SW_GLOBAL_RFEOR_MAX_FRAMES(x)            (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_RFEOR_MAX_FRAMES_SHIFT)) & SW_GLOBAL_RFEOR_MAX_FRAMES_MASK)
/*! @} */

/*! @name NETCCLKR - NETC clock register */
/*! @{ */

#define SW_GLOBAL_NETCCLKR_FREQ_MASK             (0x7FFU)
#define SW_GLOBAL_NETCCLKR_FREQ_SHIFT            (0U)
#define SW_GLOBAL_NETCCLKR_FREQ_WIDTH            (11U)
#define SW_GLOBAL_NETCCLKR_FREQ(x)               (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_NETCCLKR_FREQ_SHIFT)) & SW_GLOBAL_NETCCLKR_FREQ_MASK)
/*! @} */

/*! @name HTACAPR - HTA 0 capability register */
/*! @{ */

#define SW_GLOBAL_HTACAPR_MAX_RX_FRAMES_MASK     (0xFFU)
#define SW_GLOBAL_HTACAPR_MAX_RX_FRAMES_SHIFT    (0U)
#define SW_GLOBAL_HTACAPR_MAX_RX_FRAMES_WIDTH    (8U)
#define SW_GLOBAL_HTACAPR_MAX_RX_FRAMES(x)       (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTACAPR_MAX_RX_FRAMES_SHIFT)) & SW_GLOBAL_HTACAPR_MAX_RX_FRAMES_MASK)

#define SW_GLOBAL_HTACAPR_MAX_TX_FRAMES_MASK     (0xFF00U)
#define SW_GLOBAL_HTACAPR_MAX_TX_FRAMES_SHIFT    (8U)
#define SW_GLOBAL_HTACAPR_MAX_TX_FRAMES_WIDTH    (8U)
#define SW_GLOBAL_HTACAPR_MAX_TX_FRAMES(x)       (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTACAPR_MAX_TX_FRAMES_SHIFT)) & SW_GLOBAL_HTACAPR_MAX_TX_FRAMES_MASK)
/*! @} */

/*! @name HTARFCOR - HTA 0 receive frame count operational register */
/*! @{ */

#define SW_GLOBAL_HTARFCOR_HP_COUNT_MASK         (0xFFU)
#define SW_GLOBAL_HTARFCOR_HP_COUNT_SHIFT        (0U)
#define SW_GLOBAL_HTARFCOR_HP_COUNT_WIDTH        (8U)
#define SW_GLOBAL_HTARFCOR_HP_COUNT(x)           (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTARFCOR_HP_COUNT_SHIFT)) & SW_GLOBAL_HTARFCOR_HP_COUNT_MASK)

#define SW_GLOBAL_HTARFCOR_HP_HWM_MASK           (0xFF00U)
#define SW_GLOBAL_HTARFCOR_HP_HWM_SHIFT          (8U)
#define SW_GLOBAL_HTARFCOR_HP_HWM_WIDTH          (8U)
#define SW_GLOBAL_HTARFCOR_HP_HWM(x)             (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTARFCOR_HP_HWM_SHIFT)) & SW_GLOBAL_HTARFCOR_HP_HWM_MASK)

#define SW_GLOBAL_HTARFCOR_LP_COUNT_MASK         (0xFF0000U)
#define SW_GLOBAL_HTARFCOR_LP_COUNT_SHIFT        (16U)
#define SW_GLOBAL_HTARFCOR_LP_COUNT_WIDTH        (8U)
#define SW_GLOBAL_HTARFCOR_LP_COUNT(x)           (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTARFCOR_LP_COUNT_SHIFT)) & SW_GLOBAL_HTARFCOR_LP_COUNT_MASK)

#define SW_GLOBAL_HTARFCOR_LP_HWM_MASK           (0xFF000000U)
#define SW_GLOBAL_HTARFCOR_LP_HWM_SHIFT          (24U)
#define SW_GLOBAL_HTARFCOR_LP_HWM_WIDTH          (8U)
#define SW_GLOBAL_HTARFCOR_LP_HWM(x)             (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTARFCOR_LP_HWM_SHIFT)) & SW_GLOBAL_HTARFCOR_LP_HWM_MASK)
/*! @} */

/*! @name HTAHPBCOR - HTA 0 high priority byte count operational register */
/*! @{ */

#define SW_GLOBAL_HTAHPBCOR_HP_COUNT_MASK        (0xFFFFU)
#define SW_GLOBAL_HTAHPBCOR_HP_COUNT_SHIFT       (0U)
#define SW_GLOBAL_HTAHPBCOR_HP_COUNT_WIDTH       (16U)
#define SW_GLOBAL_HTAHPBCOR_HP_COUNT(x)          (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTAHPBCOR_HP_COUNT_SHIFT)) & SW_GLOBAL_HTAHPBCOR_HP_COUNT_MASK)

#define SW_GLOBAL_HTAHPBCOR_HWM_MASK             (0xFFFF0000U)
#define SW_GLOBAL_HTAHPBCOR_HWM_SHIFT            (16U)
#define SW_GLOBAL_HTAHPBCOR_HWM_WIDTH            (16U)
#define SW_GLOBAL_HTAHPBCOR_HWM(x)               (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTAHPBCOR_HWM_SHIFT)) & SW_GLOBAL_HTAHPBCOR_HWM_MASK)
/*! @} */

/*! @name HTALPBCOR - HTA 0 low priority byte count operational register */
/*! @{ */

#define SW_GLOBAL_HTALPBCOR_LP_COUNT_MASK        (0xFFFFU)
#define SW_GLOBAL_HTALPBCOR_LP_COUNT_SHIFT       (0U)
#define SW_GLOBAL_HTALPBCOR_LP_COUNT_WIDTH       (16U)
#define SW_GLOBAL_HTALPBCOR_LP_COUNT(x)          (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTALPBCOR_LP_COUNT_SHIFT)) & SW_GLOBAL_HTALPBCOR_LP_COUNT_MASK)

#define SW_GLOBAL_HTALPBCOR_HWM_MASK             (0xFFFF0000U)
#define SW_GLOBAL_HTALPBCOR_HWM_SHIFT            (16U)
#define SW_GLOBAL_HTALPBCOR_HWM_WIDTH            (16U)
#define SW_GLOBAL_HTALPBCOR_HWM(x)               (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTALPBCOR_HWM_SHIFT)) & SW_GLOBAL_HTALPBCOR_HWM_MASK)
/*! @} */

/*! @name HTATFCOR - HTA 0 transmit frame count operational register */
/*! @{ */

#define SW_GLOBAL_HTATFCOR_HP_COUNT_MASK         (0xFFU)
#define SW_GLOBAL_HTATFCOR_HP_COUNT_SHIFT        (0U)
#define SW_GLOBAL_HTATFCOR_HP_COUNT_WIDTH        (8U)
#define SW_GLOBAL_HTATFCOR_HP_COUNT(x)           (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTATFCOR_HP_COUNT_SHIFT)) & SW_GLOBAL_HTATFCOR_HP_COUNT_MASK)

#define SW_GLOBAL_HTATFCOR_HP_HWM_MASK           (0xFF00U)
#define SW_GLOBAL_HTATFCOR_HP_HWM_SHIFT          (8U)
#define SW_GLOBAL_HTATFCOR_HP_HWM_WIDTH          (8U)
#define SW_GLOBAL_HTATFCOR_HP_HWM(x)             (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTATFCOR_HP_HWM_SHIFT)) & SW_GLOBAL_HTATFCOR_HP_HWM_MASK)

#define SW_GLOBAL_HTATFCOR_LP_COUNT_MASK         (0xFF0000U)
#define SW_GLOBAL_HTATFCOR_LP_COUNT_SHIFT        (16U)
#define SW_GLOBAL_HTATFCOR_LP_COUNT_WIDTH        (8U)
#define SW_GLOBAL_HTATFCOR_LP_COUNT(x)           (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTATFCOR_LP_COUNT_SHIFT)) & SW_GLOBAL_HTATFCOR_LP_COUNT_MASK)

#define SW_GLOBAL_HTATFCOR_LP_HWM_MASK           (0xFF000000U)
#define SW_GLOBAL_HTATFCOR_LP_HWM_SHIFT          (24U)
#define SW_GLOBAL_HTATFCOR_LP_HWM_WIDTH          (8U)
#define SW_GLOBAL_HTATFCOR_LP_HWM(x)             (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_HTATFCOR_LP_HWM_SHIFT)) & SW_GLOBAL_HTATFCOR_LP_HWM_MASK)
/*! @} */

/*! @name RCSBRLAR - Root complex 0 system bus read latency average register */
/*! @{ */

