zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_SW_GLOBAL.h
#define SW_GLOBAL_RCSBRLAR_FRACT_MASK            (0xFFU)
#define SW_GLOBAL_RCSBRLAR_FRACT_SHIFT           (0U)
#define SW_GLOBAL_RCSBRLAR_FRACT_WIDTH           (8U)
#define SW_GLOBAL_RCSBRLAR_FRACT(x)              (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_RCSBRLAR_FRACT_SHIFT)) & SW_GLOBAL_RCSBRLAR_FRACT_MASK)

#define SW_GLOBAL_RCSBRLAR_INT_MASK              (0xFFF00U)
#define SW_GLOBAL_RCSBRLAR_INT_SHIFT             (8U)
#define SW_GLOBAL_RCSBRLAR_INT_WIDTH             (12U)
#define SW_GLOBAL_RCSBRLAR_INT(x)                (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_RCSBRLAR_INT_SHIFT)) & SW_GLOBAL_RCSBRLAR_INT_MASK)
/*! @} */

/*! @name RCSBRLHWMR - Root complex 0 system bus read latency high watermark register */
/*! @{ */

#define SW_GLOBAL_RCSBRLHWMR_FRACT_MASK          (0xFFU)
#define SW_GLOBAL_RCSBRLHWMR_FRACT_SHIFT         (0U)
#define SW_GLOBAL_RCSBRLHWMR_FRACT_WIDTH         (8U)
#define SW_GLOBAL_RCSBRLHWMR_FRACT(x)            (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_RCSBRLHWMR_FRACT_SHIFT)) & SW_GLOBAL_RCSBRLHWMR_FRACT_MASK)

#define SW_GLOBAL_RCSBRLHWMR_INT_MASK            (0xFFF00U)
#define SW_GLOBAL_RCSBRLHWMR_INT_SHIFT           (8U)
#define SW_GLOBAL_RCSBRLHWMR_INT_WIDTH           (12U)
#define SW_GLOBAL_RCSBRLHWMR_INT(x)              (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_RCSBRLHWMR_INT_SHIFT)) & SW_GLOBAL_RCSBRLHWMR_INT_MASK)
/*! @} */

/*! @name RCSBWLAR - Root complex 0 system bus write latency average register */
/*! @{ */

#define SW_GLOBAL_RCSBWLAR_FRACT_MASK            (0xFFU)
#define SW_GLOBAL_RCSBWLAR_FRACT_SHIFT           (0U)
#define SW_GLOBAL_RCSBWLAR_FRACT_WIDTH           (8U)
#define SW_GLOBAL_RCSBWLAR_FRACT(x)              (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_RCSBWLAR_FRACT_SHIFT)) & SW_GLOBAL_RCSBWLAR_FRACT_MASK)

#define SW_GLOBAL_RCSBWLAR_INT_MASK              (0xFFF00U)
#define SW_GLOBAL_RCSBWLAR_INT_SHIFT             (8U)
#define SW_GLOBAL_RCSBWLAR_INT_WIDTH             (12U)
#define SW_GLOBAL_RCSBWLAR_INT(x)                (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_RCSBWLAR_INT_SHIFT)) & SW_GLOBAL_RCSBWLAR_INT_MASK)
/*! @} */

/*! @name RCSBWLHWMR - Root complex 0 system bus write latency high watermark register */
/*! @{ */

#define SW_GLOBAL_RCSBWLHWMR_FRACT_MASK          (0xFFU)
#define SW_GLOBAL_RCSBWLHWMR_FRACT_SHIFT         (0U)
#define SW_GLOBAL_RCSBWLHWMR_FRACT_WIDTH         (8U)
#define SW_GLOBAL_RCSBWLHWMR_FRACT(x)            (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_RCSBWLHWMR_FRACT_SHIFT)) & SW_GLOBAL_RCSBWLHWMR_FRACT_MASK)

#define SW_GLOBAL_RCSBWLHWMR_INT_MASK            (0xFFF00U)
#define SW_GLOBAL_RCSBWLHWMR_INT_SHIFT           (8U)
#define SW_GLOBAL_RCSBWLHWMR_INT_WIDTH           (12U)
#define SW_GLOBAL_RCSBWLHWMR_INT(x)              (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_RCSBWLHWMR_INT_SHIFT)) & SW_GLOBAL_RCSBWLHWMR_INT_MASK)
/*! @} */

/*! @name IPBRR0 - IP block revision register 0 */
/*! @{ */

#define SW_GLOBAL_IPBRR0_IP_MN_MASK              (0xFFU)
#define SW_GLOBAL_IPBRR0_IP_MN_SHIFT             (0U)
#define SW_GLOBAL_IPBRR0_IP_MN_WIDTH             (8U)
#define SW_GLOBAL_IPBRR0_IP_MN(x)                (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_IPBRR0_IP_MN_SHIFT)) & SW_GLOBAL_IPBRR0_IP_MN_MASK)

#define SW_GLOBAL_IPBRR0_IP_MJ_MASK              (0xFF00U)
#define SW_GLOBAL_IPBRR0_IP_MJ_SHIFT             (8U)
#define SW_GLOBAL_IPBRR0_IP_MJ_WIDTH             (8U)
#define SW_GLOBAL_IPBRR0_IP_MJ(x)                (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_IPBRR0_IP_MJ_SHIFT)) & SW_GLOBAL_IPBRR0_IP_MJ_MASK)
/*! @} */

/*! @name IPBRR1 - IP block revision register 1 */
/*! @{ */

#define SW_GLOBAL_IPBRR1_IP_CFG_MASK             (0xFFU)
#define SW_GLOBAL_IPBRR1_IP_CFG_SHIFT            (0U)
#define SW_GLOBAL_IPBRR1_IP_CFG_WIDTH            (8U)
#define SW_GLOBAL_IPBRR1_IP_CFG(x)               (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_IPBRR1_IP_CFG_SHIFT)) & SW_GLOBAL_IPBRR1_IP_CFG_MASK)

#define SW_GLOBAL_IPBRR1_IP_MNT_MASK             (0xFF00U)
#define SW_GLOBAL_IPBRR1_IP_MNT_SHIFT            (8U)
#define SW_GLOBAL_IPBRR1_IP_MNT_WIDTH            (8U)
#define SW_GLOBAL_IPBRR1_IP_MNT(x)               (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_IPBRR1_IP_MNT_SHIFT)) & SW_GLOBAL_IPBRR1_IP_MNT_MASK)

#define SW_GLOBAL_IPBRR1_IP_INT_MASK             (0xFF0000U)
#define SW_GLOBAL_IPBRR1_IP_INT_SHIFT            (16U)
#define SW_GLOBAL_IPBRR1_IP_INT_WIDTH            (8U)
#define SW_GLOBAL_IPBRR1_IP_INT(x)               (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_IPBRR1_IP_INT_SHIFT)) & SW_GLOBAL_IPBRR1_IP_INT_MASK)
/*! @} */

/*! @name FBLPR - Function boot loader parameter register 0..Function boot loader parameter register 1 */
/*! @{ */

#define SW_GLOBAL_FBLPR_PARAM_VAL_MASK           (0xFFFFFFFFU)
#define SW_GLOBAL_FBLPR_PARAM_VAL_SHIFT          (0U)
#define SW_GLOBAL_FBLPR_PARAM_VAL_WIDTH          (32U)
#define SW_GLOBAL_FBLPR_PARAM_VAL(x)             (((uint32_t)(((uint32_t)(x)) << SW_GLOBAL_FBLPR_PARAM_VAL_SHIFT)) & SW_GLOBAL_FBLPR_PARAM_VAL_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group SW_GLOBAL_Register_Masks */

/*!
 * @}
 */ /* end of group SW_GLOBAL_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_SW_GLOBAL_H_) */
